// 某石油公司计划建造一条由东向西的主输油管道。该管道要穿过一个有n 口油井的油田。从每口油井都要有一条输油管道沿最短路经(或南或北)与主管道相连。如果给定n口油井的位置,即它们的x 坐标（东西向）和y 坐标（南北向）,应如何确定主管道的最优位置,即使各油井到主管道之间的输油管道长度总和最小的位置?  证明可在线性时间内确定主管道的最优位置。

// 给定n口油井的位置, 计算各油井到主管道之间的输油管道最小长度总和。

// 输入格式:
// 输入的第1 行是油井数n，1<=n<=10000。接下来n 行是
// 油井的位置，每行2个用空格割开的整数 x和 y，-10000<=x，y<=10000。

// 输出格式:
// 输出油井到主管道之间的输油管道最小长度总和。

// 输入样例:
// 5
// 1 2
// 2 2
// 1 3
// 3 -2
// 3 3
// 输出样例:
// 6
#include <bits/stdc++.h>
using namespace std;
int a[10010];
int main()
{
    int n ;
    cin >>n;
    int l = 10000,r = -10000;
    for(int i = 1;i <=n;i++)
        {
            int x,y;
            cin >> x >> y;
            a[i] = y;
            l = min(l,y);
            r = max(r,y);
        }
    //二分判断函数
   auto f = [&](int x)->int{
       int ans = 0;
    for(int i = 1;i<=n;i++)
        {
            ans +=abs(a[i]-x);
        }
       return ans;
   };
    while(l<r)
        {
            int mid = (l+r)>>1;
            if(f(mid)<=f(mid+1))
            {
                r= mid ;
            }
            else
            {
                l=mid+1;
            }
        }
    cout << f(l);//求和
    return 0;
}